In [1]:
# Load Dependencies
import pandas as pd
import numpy as np

In [2]:
# Read in the CSV files
rate_data = pd.read_csv("../Resources/30_year_fixed_mortgage_rates.csv")
debt_data = pd.read_csv("../Resources/fed_debt_total_public_debt.csv")
fed_rate_data = pd.read_csv("../Resources/fed-funds-rate-historical-chart.csv")
hpi_data = pd.read_csv("../Resources/all_transactions_hpi_us.csv")
median_income = pd.read_csv("../Resources/MEFAINUSA672N.csv")
median_sales = pd.read_csv("../Resources/MSPUS.csv")

In [3]:
# Create the DataFrames, all start @ 1/1/1975, Fed_Funds is daily, 30_year is monthly, All_HPI_US & Fed_Debt are quarterly 
rate_df = pd.DataFrame(rate_data)
debt_df = pd.DataFrame(debt_data)
fed_rate_df = pd.DataFrame(fed_rate_data)
hpi_df = pd.DataFrame(hpi_data)
income_df = pd.DataFrame(median_income)
sales_df = pd.DataFrame(median_sales)

In [4]:
# Update the debt and hpi dfs column to align with other 2 dfs
debt_df.rename(columns={'observation_date': 'Date'}, inplace=True)
hpi_df.rename(columns={'observation_date': 'Date'}, inplace=True)
income_df.rename(columns={'observation_date': 'Date'}, inplace=True)
sales_df.rename(columns={'observation_date': 'Date'}, inplace=True)

In [5]:
# List all DataFrames
dfs = [rate_df, debt_df, fed_rate_df, hpi_df, income_df, sales_df]

# Apply datetime conversion to each df
for df in dfs:
    df['Date'] = pd.to_datetime(df['Date'])

In [6]:
# Display each DataFrame (Monthly)
rate_df.head()

        Date  Fixed_30_Rate
0 1975-01-01           9.29
1 1975-02-01           9.02
2 1975-03-01           8.86
3 1975-04-01           8.84
4 1975-05-01           8.89

In [7]:
# Rename GFDEBTN column
debt_df.rename(columns={'GFDEBTN': 'Total_Public_Debt'}, inplace=True)

# Display each DataFrame (Quarterly)
debt_df.head()

        Date  Total_Public_Debt
0 1975-01-01             509659
1 1975-04-01             533188
2 1975-07-01             553647
3 1975-10-01             576649
4 1976-01-01             600490

In [8]:
# Display each DataFrame (Daily - skips Weekends)
fed_rate_df.head()

        Date  Fed_Funds_Rate
0 1975-01-01            3.87
1 1975-01-02            8.55
2 1975-01-03            8.37
3 1975-01-04            8.37
4 1975-01-05            8.37

In [9]:
# Rename USSTHPI column as House_Price_Index
hpi_df.rename(columns={'USSTHPI': 'House_Price_Index'}, inplace=True)

# Display each DataFrame (Monthly)
hpi_df.head()

        Date  House_Price_Index
0 1975-01-01              59.78
1 1975-04-01              60.74
2 1975-07-01              61.02
3 1975-10-01              62.19
4 1976-01-01              62.73

In [10]:
# Update the df to show only 1st of the month
fed_rate_df = fed_rate_df.resample('MS', on='Date').first()

In [11]:
# Reset the index to ensure 'Date' remains a column
fed_rate_df.reset_index(inplace=True)

# Check for column names
fed_rate_df.columns = ['Date', 'Fed_Funds_Rate']

# Display the updated df
fed_rate_df.head()

        Date  Fed_Funds_Rate
0 1975-01-01            3.87
1 1975-02-01            6.76
2 1975-03-01            6.07
3 1975-04-01            5.48
4 1975-05-01            5.55

In [12]:
# Convert the monthly dfs to report only quarterly to align with hpi and debt
fed_rate_df = fed_rate_df[fed_rate_df['Date'].dt.month.isin([1, 4, 7, 10])]
rate_df = rate_df[rate_df['Date'].dt.month.isin([1, 4, 7, 10])]

In [13]:
# Display updated dfs
fed_rate_df.head()

         Date  Fed_Funds_Rate
0  1975-01-01            3.87
3  1975-04-01            5.48
6  1975-07-01            6.12
9  1975-10-01            6.24
12 1976-01-01            5.37

In [14]:
# Display updated dfs
rate_df.head()

         Date  Fixed_30_Rate
0  1975-01-01           9.29
3  1975-04-01           8.84
6  1975-07-01           8.89
9  1975-10-01           9.24
12 1976-01-01           8.90

In [15]:
# Display updated dfs
hpi_df.head()

        Date  House_Price_Index
0 1975-01-01              59.78
1 1975-04-01              60.74
2 1975-07-01              61.02
3 1975-10-01              62.19
4 1976-01-01              62.73

In [16]:
# Display updated dfs
debt_df.head()

        Date  Total_Public_Debt
0 1975-01-01             509659
1 1975-04-01             533188
2 1975-07-01             553647
3 1975-10-01             576649
4 1976-01-01             600490

In [17]:
# Set the end date limit
end_date = "2025-01-01"

# Filter rate_df and fed_rate_df to end at the same date as hpi_df and debt_df
rate_df = rate_df[rate_df["Date"] <= end_date]
fed_rate_df = fed_rate_df[fed_rate_df["Date"] <= end_date]

In [18]:
# Confirm end date updates completed
print(rate_df.tail())  # Check last few entries
print(fed_rate_df.tail())  # Confirm end date matches

          Date  Fixed_30_Rate
588 2024-01-01           6.69
591 2024-04-01           7.17
594 2024-07-01           6.78
597 2024-10-01           6.72
600 2025-01-01           6.95
          Date  Fed_Funds_Rate
588 2024-01-01            5.33
591 2024-04-01            5.33
594 2024-07-01            5.33
597 2024-10-01            4.83
600 2025-01-01            4.33

In [19]:
# Rename the columns
income_df.rename(columns={'MEFAINUSA672N': 'Median_Household_Income'}, inplace=True)
# Display the df
income_df.head()

        Date  Median_Household_Income
0 1975-01-01                    66480
1 1976-01-01                    68580
2 1977-01-01                    68940
3 1978-01-01                    71100
4 1979-01-01                    72120

In [22]:
# Get the range of years in your dataset
years = income_df["Date"].dt.year.unique()

# Generate only the missing quarterly start dates (4/1, 7/1, and 10/1) for each year
quarterly_dates = [pd.Timestamp(year, month, 1) for year in years for month in [4, 7, 10]]

# Create a DataFrame for the missing quarterly dates
missing_quarters_df = pd.DataFrame({"Date": quarterly_dates})

# Merge with your existing income data, forward-filling to fill the quarterly gaps
quarterly_income = pd.concat([income_df, missing_quarters_df], ignore_index=True).sort_values("Date")
quarterly_income["Median_Household_Income"] = quarterly_income["Median_Household_Income"].ffill()

# Display the updated DataFrame
quarterly_income.head()

         Date  Median_Household_Income
0  1975-01-01                  66480.0
49 1975-04-01                  66480.0
50 1975-07-01                  66480.0
51 1975-10-01                  66480.0
1  1976-01-01                  68580.0

In [23]:
# Rename MSPUS column
sales_df.rename(columns={'MSPUS': 'Median_Sales_Price'}, inplace=True)

# Display DataFrame
sales_df.head()

        Date  Median_Sales_Price
0 1975-01-01               38100
1 1975-04-01               39000
2 1975-07-01               38800
3 1975-10-01               41200
4 1976-01-01               42800

In [24]:
# Save each DataFrame to CSV inside the Output folder
rate_df.to_csv("../Output/rate_data.csv", index=False)
debt_df.to_csv("../Output/debt_data.csv", index=False)
fed_rate_df.to_csv("../Output/fed_rate_data.csv", index=False)
hpi_df.to_csv("../Output/hpi_data.csv", index=False)
quarterly_income.to_csv("../Output/median_income.csv", index=False)
sales_df.to_csv("../Output/median_sales.csv", index=False)

In [25]:
import os

# Check if the files exist in Output/
output_files = ["rate_data.csv", "debt_data.csv", "fed_rate_data.csv", "hpi_data.csv", "median_income.csv", "median_sales.csv"]
for file in output_files:
    print(file, "exists:", os.path.exists(f"../Output/{file}"))

rate_data.csv exists: True
debt_data.csv exists: True
fed_rate_data.csv exists: True
hpi_data.csv exists: True
median_income.csv exists: True
median_sales.csv exists: True